docs(calling): improvements
